freesbeeGE/test/dati/d/test18.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ge="http://ge.freesbee.unibas.it/">
    <soap:Header/>
    <soap:Body>
        <ge:consegnaMessaggio>
            <messaggioSoap>
                <comunicazioneEliminazionePubblicatore>
                    <pubblicatore>
                        <nomePubblicatore>P</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <categoriaPubblicata>Test5</categoriaPubblicata>
                </comunicazioneEliminazionePubblicatore>
            </messaggioSoap>
            <nomePubblicatore>GE</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:consegnaMessaggio>
    </soap:Body>
</soap:Envelope>